Embedfire-motor/ebf_motor_tutorial_code_stm32f429_tiaozhanzhe/basis_part/stepper—PWM控制匀速旋转/User/stepper/bsp_stepper_init.h
#ifndef __BSP_STEP_MOTOR_INIT_H
#define	__BSP_STEP_MOTOR_INIT_H

#include "stm32f4xx.h"
#include "stm32f4xx_hal.h"

/*宏定义*/
/*******************************************************/

//Motor 方向 
#define MOTOR_DIR_PIN                  	GPIO_PIN_14
#define MOTOR_DIR_GPIO_PORT            	GPIOB                   
#define MOTOR_DIR_GPIO_CLK_ENABLE()   	__HAL_RCC_GPIOB_CLK_ENABLE()

//Motor 使能 
#define MOTOR_EN_PIN                  	GPIO_PIN_12
#define MOTOR_EN_GPIO_PORT            	GPIOB                      
#define MOTOR_EN_GPIO_CLK_ENABLE()    	__HAL_RCC_GPIOB_CLK_ENABLE()
	
//Motor 脉冲

#define MOTOR_PUL_TIM                   TIM8
#define MOTOR_PUL_CLK_ENABLE()  		__TIM8_CLK_ENABLE()

#define MOTOR_PUL_PORT       			      GPIOC
#define MOTOR_PUL_PIN             		  GPIO_PIN_6
#define MOTOR_PUL_GPIO_CLK_ENABLE()		  __HAL_RCC_GPIOC_CLK_ENABLE()

#define MOTOR_PUL_GPIO_AF               GPIO_AF3_TIM8
#define MOTOR_PUL_CHANNEL_x             TIM_CHANNEL_1



////Motor 方向 
//#define MOTOR_DIR_PIN                  	GPIO_PIN_1   
//#define MOTOR_DIR_GPIO_PORT            	GPIOE                    
//#define MOTOR_DIR_GPIO_CLK_ENABLE()   	__HAL_RCC_GPIOE_CLK_ENABLE()

////Motor 使能 
//#define MOTOR_EN_PIN                  	GPIO_PIN_0
//#define MOTOR_EN_GPIO_PORT            	GPIOE                       
//#define MOTOR_EN_GPIO_CLK_ENABLE()    	__HAL_RCC_GPIOE_CLK_ENABLE()
//	
////Motor 脉冲		

//#define MOTOR_PUL_TIM                   TIM8
//#define MOTOR_PUL_CLK_ENABLE()  	    	__TIM8_CLK_ENABLE()

//#define MOTOR_PUL_PORT                  GPIOI
//#define MOTOR_PUL_PIN                   GPIO_PIN_5
//#define MOTOR_PUL_GPIO_CLK_ENABLE()	  	__HAL_RCC_GPIOI_CLK_ENABLE()

//#define MOTOR_PUL_GPIO_AF               GPIO_AF3_TIM8
//#define MOTOR_PUL_CHANNEL_x             TIM_CHANNEL_1




extern void TIMx_Configuration(void);
extern void TIM2_SetPWM_pulse(int channel,int compare);

	
/************************************************************/

#define CLOCKWISE 			1//顺时针
#define ANTI_CLOCKWISE	0//逆时针



//控制使能引脚
/* 带参宏，可以像内联函数一样使用 */
#define MOTOR_EN(x)					HAL_GPIO_WritePin(MOTOR_EN_GPIO_PORT,MOTOR_EN_PIN,x)
#define MOTOR_PLU(x)				HAL_GPIO_WritePin(MOTOR_PUL_GPIO_PORT,MOTOR_PUL_PIN,x)
#define MOTOR_DIR(x)				HAL_GPIO_WritePin(MOTOR_DIR_GPIO_PORT,MOTOR_DIR_PIN,x)

extern void stepper_Init(void);
extern void stepper_turn(int tim,float angle,float subdivide,uint8_t dir);
#endif /* __STEP_MOTOR_INIT_H */
